## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_subnet.app_subnet will be created
  + resource "azurerm_subnet" "app_subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "khad0062-a12-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "khad0062-a12-rg"
      + virtual_network_name                           = "khad0062-a12-vnet"
    }

  # azurerm_virtual_network.app_vnet will be created
  + resource "azurerm_virtual_network" "app_vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "khad0062-a12-vnet"
      + resource_group_name = "khad0062-a12-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "created_by"  = "terraform"
          + "environment" = "prod"
          + "lab"         = "a12"
          + "purpose"     = "application-networking"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + subnet_id               = (known after apply)
  + subnet_name             = "khad0062-a12-subnet"
  + virtual_network_id      = (known after apply)
  + virtual_network_name    = "khad0062-a12-vnet"
```
</details>